IDEA Open Model
Segment3D.LocalCoordinateSystem Property
Compatible with IDEA StatiCa 20.1
 Local coordinate system
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public CoordSystem LocalCoordinateSystem { get; set; }
Public Property LocalCoordinateSystem As CoordSystem
	Get
	Set
Property Value
Type: CoordSystem
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace